Training Dataset: /Users/keelanoriordan/Desktop/GitHub_MacPro.nosync/242-Final-Project/DATASET/nuc/single_rater.pkl
Model Hyperparameters: Optimizer = adam, Learning Rate = 0.001, Batch Size = 512, epoch = 300, l2 norm = 0.0001, block connection = [True, True, True, True], block configuration = (6, 8, 8, 12), Growth Rate = 64, Drop Rate = 0.4, Step Size = 1, Gamma = 0.99
Class Map: {'sTIL': '[1. 0.]', 'tumor_any': '[0. 1.]'}
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
├─Flatten: 1-1                           [-1, 19200]               --
├─Linear: 1-2                            [-1, 512]                 9,830,912
├─Sigmoid: 1-3                           [-1, 512]                 --
├─Linear: 1-4                            [-1, 128]                 65,664
├─Sigmoid: 1-5                           [-1, 128]                 --
├─Linear: 1-6                            [-1, 2]                   258
├─Softmax: 1-7                           [-1, 2]                   --
==========================================================================================
Total params: 9,896,834
Trainable params: 9,896,834
Non-trainable params: 0
Total mult-adds (M): 9.90
==========================================================================================
Input size (MB): 0.07
Forward/backward pass size (MB): 0.00
Params size (MB): 37.75
Estimated Total Size (MB): 37.83
==========================================================================================
